app/controllers/homes_controller.rb

SELECT "homes".* FROM "homes"
---
  def index
    @homes = Home.all

INSERT INTO "homes" ("address", "price", "sqft", "bedrooms", "bathrooms", "year", "lot", "monthly", "extras", "mortgage", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"
---
  def create
    @home = Home.new(home_params)

    if @home.save

DELETE FROM "homes" WHERE "homes"."id" = $1  [["id", 1]]
---
  def destroy
    # @home.destroy
    home = Home.destroy(params[:id])

SELECT "homes".* FROM "homes" WHERE "homes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_home
      @home = Home.find(params[:id])